(function () {
    'use strict';

    angular.module('registry')
        .constant('REGIONS', [
            {
                name: 'Алтайский край',
                code: '22',
				'zone_id': '50'
            },
            {
                name: 'Амурская область',
                code: '28',
				'zone_id': '53'
            },
            {
                name: 'Архангельская область',
                code: '29',
				'zone_id': '48'
            },
            {
                name: 'Астраханская область',
                code: '30',
				'zone_id': '49'
            },
            {
                name: 'Белгородская область',
                code: '31',
				'zone_id': '51'
            },
            {
                name: 'Брянская область',
                code: '32',
				'zone_id': '54'
            },
            {
                name: 'Владимирская область',
                code: '33',
				'zone_id': '118'
            },
            {
                name: 'Волгоградская область',
                code: '34',
				'zone_id': '120'
            },
            {
                name: 'Вологодская область',
                code: '35',
				'zone_id': '121'
            },
            {
                name: 'Воронежская область',
                code: '36',
				'zone_id': '122'
            },
            {
                name: 'г. Москва',
                code: '77',
				'zone_id': '83'
            },
            {
                name: 'Еврейская автономная область',
                code: '79',
				'zone_id': '52'
            },
            {
                name: 'Забайкальский край',
                code: '75',
				'zone_id': '58'
            },
            {
                name: 'Ивановская область',
                code: '37',
				'zone_id': '65'
            },
            {
                name: 'Иные территории, включая город и космодром Байконур',
                code: '99',
				'zone_id': 'none'
            },
            {
                name: 'Иркутская область',
                code: '38',
				'zone_id': '64'
            },
            {
                name: 'Кабардино-Балкарская Республика',
                code: '07',
				'zone_id': '85'
            },
            {
                name: 'Калининградская область',
                code: '39',
				'zone_id': '67'
            },
            {
                name: 'Калужская область',
                code: '40',
				'zone_id': '68'
            },
            {
                name: 'Камчатский край',
                code: '41',
				'zone_id': '96'
            },
            {
                name: 'Карачаево-Черкесская Республика',
                code: '09',
				'zone_id': '57'
            },
            {
                name: 'Кемеровская область',
                code: '42',
				'zone_id': '70'
            },
            {
                name: 'Кировская область',
                code: '43',
				'zone_id': '123'
            },
            {
                name: 'Костромская область',
                code: '44',
				'zone_id': '73'
            },
            {
                name: 'Краснодарский край',
                code: '23',
				'zone_id': '74'
            },
            {
                name: 'Красноярский край',
                code: '24',
				'zone_id': '75'
            },
            {
                name: 'Курганская область',
                code: '45',
				'zone_id': '76'
            },
            {
                name: 'Курская область',
                code: '46',
				'zone_id': '77'
            },
            {
                name: 'Ленинградская область',
                code: '47',
				'zone_id': '59'
            },
            {
                name: 'Липецкая область',
                code: '48',
				'zone_id': '79'
            },
            {
                name: 'Магаданская область',
                code: '49',
				'zone_id': '80'
            },
            {
                name: 'Московская область',
                code: '50',
				'zone_id': '46'
            },
            {
                name: 'Мурманская область',
                code: '51',
				'zone_id': '84'
            },
            {
                name: 'Ненецкий автономный округ',
                code: '83',
				'zone_id': '86'
            },
            {
                name: 'Нижегородская область',
                code: '52',
				'zone_id': '88'
            },
            {
                name: 'Новгородская область',
                code: '53',
				'zone_id': '89'
            },
            {
                name: 'Новосибирская область',
                code: '54',
				'zone_id': '90'
            },
            {
                name: 'Омская область',
                code: '55',
				'zone_id': '91'
            },
            {
                name: 'Оренбургская область',
                code: '56',
				'zone_id': '93'
            },
            {
                name: 'Орловская область',
                code: '57',
				'zone_id': '92'
            },
            {
                name: 'Пензенская область',
                code: '58',
				'zone_id': '94'
            },
            {
                name: 'Пермский край',
                code: '59',
				'zone_id': '95'
            },
            {
                name: 'Приморский край',
                code: '25',
				'zone_id': '119'
            },
            {
                name: 'Псковская область',
                code: '60',
				'zone_id': '98'
            },
            {
                name: 'Республика Адыгея (Адыгея)',
                code: '01',
				'zone_id': '82'
            },
            {
                name: 'Республика Алтай',
                code: '04',
				'zone_id': '50'
            },
            {
                name: 'Республика Башкортостан',
                code: '02',
				'zone_id': '114'
            },
            {
                name: 'Республика Бурятия',
                code: '03',
				'zone_id': '116'
            },
            {
                name: 'Республика Дагестан',
                code: '05',
				'zone_id': '81'
            },
            {
                name: 'Республика Ингушетия',
                code: '06',
				'zone_id': 'ZONEIDDDDDDDDDD'
            },
            {
                name: 'Республика Калмыкия',
                code: '08',
				'zone_id': '60'
            },
            {
                name: 'Республика Карелия',
                code: '10',
				'zone_id': '97'
            },
            {
                name: 'Республика Коми',
                code: '11',
				'zone_id': '108'
            },
            {
                name: 'Республика Крым',
                code: '91',
				'zone_id': '128'
            },
            {
                name: 'Республика Марий Эл',
                code: '12',
				'zone_id': '127'
            },
            {
                name: 'Республика Мордовия',
                code: '13',
				'zone_id': '103'
            },
            {
                name: 'Республика Саха (Якутия)',
                code: '14',
				'zone_id': '124'
            },
            {
                name: 'Республика Северная Осетия - Алания',
                code: '15',
				'zone_id': '117'
            },
            {
                name: 'Республика Татарстан (Татарстан)',
                code: '16',
				'zone_id': '69'
            },
            {
                name: 'Республика Тыва',
                code: '17',
				'zone_id': '78'
            },
            {
                name: 'Республика Хакасия',
                code: '19',
				'zone_id': '45'
            },
            {
                name: 'Ростовская область',
                code: '61',
				'zone_id': '99'
            },
            {
                name: 'Рязанская область',
                code: '62',
				'zone_id': '100'
            },
            {
                name: 'Самарская область',
                code: '63',
				'zone_id': '102'
            },
            {
                name: 'Санкт-Петербург',
                code: '78',
				'zone_id': '106'
            },
            {
                name: 'Саратовская область',
                code: '64',
				'zone_id': '104'
            },
            {
                name: 'Сахалинская область',
                code: '65',
				'zone_id': '61'
            },
            {
                name: 'Свердловская область',
                code: '66',
				'zone_id': '126'
            },
            {
                name: 'Севастополь',
                code: '92',
				'zone_id': '146'
            },
            {
                name: 'Смоленская область',
                code: '67',
				'zone_id': '105'
            },
            {
                name: 'Ставропольский край',
                code: '26',
				'zone_id': '107'
            },
            {
                name: 'Тамбовская область',
                code: '68',
				'zone_id': '109'
            },
            {
                name: 'Тверская область',
                code: '69',
				'zone_id': '112'
            },
            {
                name: 'Томская область',
                code: '70',
				'zone_id': '110'
            },
            {
                name: 'Тульская область',
                code: '71',
				'zone_id': '111'
            },
            {
                name: 'Тюменская область',
                code: '72',
				'zone_id': '113'
            },
            {
                name: 'Удмуртская Республика',
                code: '18',
				'zone_id': '66'
            },
            {
                name: 'Ульяновская область',
                code: '73',
				'zone_id': '115'
            },
            {
                name: 'Хабаровский край',
                code: '27',
				'zone_id': '71'
            },
            {
                name: 'Ханты-Мансийский автономный округ - Югра',
                code: '86',
				'zone_id': '72'
            },
            {
                name: 'Челябинская область',
                code: '74',
				'zone_id': '56'
            },
            {
                name: 'Чеченская Республика',
                code: '20',
				'zone_id': '63'
            },
            {
                name: 'Чувашская Республика - Чувашия',
                code: '21',
				'zone_id': '55'
            },
            {
                name: 'Чукотский автономный округ',
                code: '87',
				'zone_id': '47'
            },
            {
                name: 'Ямало-Ненецкий автономный округ',
                code: '89',
				'zone_id': '101'
            },
            {
                name: 'Ярославская область',
                code: '76',
				'zone_id': '125'
            }
        ]);
})();